app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`over_name`, `under_name`, `over_name_kana`, `under_name_kana`, `mail_address`, `sex`, `birth_day`, `role`, `password`, `updated_at`) values ('五条', '悟', 'ゴジョウ', 'サトル', 'gojou@gmail.com', '1', '1990-01-01', '2', '$2y$10$.qH7cvn4w2IDGZQVW9vhRu3CDLu4yYvoTc1b2bUmBidnM7ZmUiTzG', '2023-10-17 11:28:33')
select * from `users` where `users`.`id` = 5 and `users`.`deleted_at` is null limit 1
---
    public function registerPost(Request $request)
    {
        DB::beginTransaction();
        try{
            $old_year = $request->old_year;
            $old_month = $request->old_month;
            $old_day = $request->old_day;
            $data = $old_year . '-' . $old_month . '-' . $old_day;
            $birth_day = date('Y-m-d', strtotime($data));
            // $subjects = $request->subject;

            $user_get = User::create([
                'over_name' => $request->over_name,
                'under_name' => $request->under_name,
                'over_name_kana' => $request->over_name_kana,
                'under_name_kana' => $request->under_name_kana,
                'mail_address' => $request->mail_address,
                'sex' => $request->sex,
                'birth_day' => $birth_day,
                'role' => $request->role,
                'password' => bcrypt($request->password)
            ]);
            $user = User::findOrFail($user_get->id);