app/Http/Controllers/Authenticated/BulletinBoard/PostsController.php

select * from `post_comments` where `post_comments`.`post_id` in (1, 4)
select * from `posts`
select * from `users` where `users`.`id` in (2, 5) and `users`.`deleted_at` is null
select * from `main_categories`
select * from `likes`
---
    public function show(Request $request){
        $posts = Post::with('user', 'postComments')->get();
        $categories = MainCategory::get();
        $like = new Like;
        $post_comment = new Post;
        if(!empty($request->keyword)){
            $posts = Post::with('user', 'postComments')
            ->where('post_title', 'like', '%'.$request->keyword.'%')
            ->orWhere('post', 'like', '%'.$request->keyword.'%')->get();
        }else if($request->category_word){
            $sub_category = $request->category_word;
            $posts = Post::with('user', 'postComments')->get();

select * from `post_comments` where `post_comments`.`post_id` in (4)
select * from `posts` where `posts`.`id` = '4' limit 1
select * from `users` where `users`.`id` in (5) and `users`.`deleted_at` is null
---
    public function postDetail($post_id){
        $post = Post::with('user', 'postComments')->findOrFail($post_id);

select * from `sub_categories` where `sub_categories`.`main_category_id` in (1, 2, 3, 4)
---
    public function postInput(){
        $main_categories = MainCategory::get();

insert into `posts` (`user_id`, `post_title`, `post`) values (5, '術式反転', '赤')
---
    public function postCreate(PostFormRequest $request){
        $post = Post::create([
            'user_id' => Auth::id(),
            'post_title' => $request->post_title,
            'post' => $request->post_body
        ]);

update `posts` set `post_title` = '術式順転', `post` = '青' where `id` = '2'
---
    public function postEdit(PostFormRequest $request){
        Post::where('id', $request->post_id)->update([
            'post_title' => $request->post_title,
            'post' => $request->post_body,
        ]);

delete from `posts` where `id` = 3
select * from `posts` where `posts`.`id` = '3' limit 1
---
    public function postDelete($id){
        Post::findOrFail($id)->delete();

insert into `main_categories` (`main_category`) values ('教科')
---
    public function mainCategoryCreate(Request $request){
        MainCategory::create(['main_category' => $request->main_category_name]);

insert into `sub_categories` (`main_category_id`, `sub_category`) values ('3', '英語')
---
     public function subCategoryCreate(Request $request){
        SubCategory::create([
            'main_category_id' => $request->main_category_id,
            'sub_category' =>  $request->sub_category_name
        ]);

insert into `likes` (`like_user_id`, `like_post_id`, `created_at`) values (5, '2', '2023-10-17 12:19:42')
---
    public function postLike(Request $request){
        $user_id = Auth::id();
        $post_id = $request->post_id;

        $like = new Like;

        $like->like_user_id = $user_id;
        $like->like_post_id = $post_id;
        $like->save();

delete from `likes` where `like_user_id` = 5 and `like_post_id` = '1'
---
    public function postUnLike(Request $request){
        $user_id = Auth::id();
        $post_id = $request->post_id;

        $like = new Like;

        $like->where('like_user_id', $user_id)
             ->where('like_post_id', $post_id)
             ->delete();