app/Http/Controllers/Authenticated/BulletinBoard/PostsController.php

select * from `main_categories` where `id` = 'main_category_id'
---
    public function show(Request $request){
        $posts = Post::with('user', 'postComments')->get();
        $categories = MainCategory::get();
        $like = new Like;
        $post_comment = new Post;
        if(!empty($request->keyword)){
            $posts = Post::with('user', 'postComments','subCategories')
            ->where('post_title', 'like', '%'.$request->keyword.'%')
            ->orWhere('post', 'like', '%'.$request->keyword.'%')
            //サブカテゴリ完全一致検索記述
            // ->orWhere('sub_category',)
            ->get();
        }else if($request->category_word){
            $sub_category = $request->category_word;
            $posts = Post::with('user', 'postComments')->get();
        }else if($request->like_posts){
            $likes = Auth::user()->likePostId()->get('like_post_id');
            $posts = Post::with('user', 'postComments')
            ->whereIn('id', $likes)->get();

select * from `main_categories` where `id` in (2, 3)
---
    public function postInput(){
        $main_categories = MainCategory::get();
        $sub_categories = SubCategory::with('mainCategory')->get();